#### 📖 Terraform Plan ('src/common/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl
module.apim_itn.data.azurerm_linux_web_app.cgn_pe_backend_app_01: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.appservice_devportal_be: Still reading... [10s elapsed]
data.azurerm_linux_function_app.eucovidcert: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.appservice_continua: Still reading... [10s elapsed]
data.azurerm_linux_function_app.function_assets_cdn: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.fims_op_app: Still reading... [10s elapsed]
data.azurerm_linux_function_app.com_citizen_func: Still reading... [10s elapsed]
data.azurerm_linux_function_app.wallet_user: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.ipatente_payments_app_itn: Still reading... [10s elapsed]
data.azurerm_linux_function_app.io_sign_user: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.appservice_devportal_be: Still reading... [20s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.appservice_continua: Still reading... [20s elapsed]
data.azurerm_linux_function_app.function_assets_cdn: Still reading... [20s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.ipatente_licences_app_itn: Still reading... [10s elapsed]
data.azurerm_linux_function_app.io_sign_user: Still reading... [20s elapsed]
data.azurerm_linux_function_app.function_profile: Still reading... [10s elapsed]
data.azurerm_linux_web_app.firmaconio_selfcare_web_app: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.appservice_selfcare_be: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.cms_backoffice_app_itn: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.session_manager_03: Still reading... [10s elapsed]
data.azurerm_linux_function_app.services_app_backend_function_app: Still reading... [10s elapsed]
data.azurerm_linux_function_app.io_fims_user: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.ipatente_practices_app_itn: Still reading... [10s elapsed]
data.azurerm_linux_function_app.lollipop_function: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.ipatente_vehicles_app_itn: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.appservice_selfcare_be: Still reading... [20s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.session_manager_03: Still reading... [20s elapsed]
data.azurerm_linux_function_app.lollipop_function: Still reading... [20s elapsed]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.application_gateway_weu.azurerm_web_application_firewall_policy.api_app will be updated in-place
  ~ resource "azurerm_web_application_firewall_policy" "api_app" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-external/providers/Microsoft.Network/applicationGatewayWebApplicationFirewallPolicies/io-p-waf-appgateway-api-app-policy"
        name                = "io-p-waf-appgateway-api-app-policy"
        tags                = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (4 unchanged attributes hidden)

      ~ policy_settings {
          ~ request_body_enforcement                  = false -> true
          ~ request_body_inspect_limit_in_kb          = 0 -> 128
            # (7 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.platform_api_gateway_apim_itn.azurerm_api_management_api.platform_legacy will be created
  + resource "azurerm_api_management_api" "platform_legacy" {
      + api_management_name   = "io-p-itn-platform-api-gateway-apim-01"
      + api_type              = (known after apply)
      + description           = "IO Platform app-backend API"
      + display_name          = "Platform app-backend"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "io-p-platform-legacy-api"
      + path                  = "api/platform-legacy"
      + protocols             = [
          + "https",
        ]
      + resource_group_name   = "io-p-itn-common-rg-01"
      + revision              = "1"
      + service_url           = (known after apply)
      + subscription_required = false
      + version               = (known after apply)
      + version_set_id        = (known after apply)

      + import {
          + content_format = "openapi-link"
          + content_value  = "https://raw.githubusercontent.com/pagopa/io-backend/refs/heads/refactor-openapi-specs/openapi/generated/api_platform_legacy.yaml"
        }

      + subscription_key_parameter_names (known after apply)
    }

  # module.platform_api_gateway_apim_itn.azurerm_api_management_api_operation_policy.platform_legacy_get_ping will be created
  + resource "azurerm_api_management_api_operation_policy" "platform_legacy_get_ping" {
      + api_management_name = "io-p-itn-platform-api-gateway-apim-01"
      + api_name            = "io-p-platform-legacy-api"
      + id                  = (known after apply)
      + operation_id        = "getPing"
      + resource_group_name = "io-p-itn-common-rg-01"
      + xml_content         = <<-EOT
            <policies>
                <inbound>
                    <base />
                </inbound>
                <backend>
                    <base />
                </backend>
                <outbound>
                    <base />
                </outbound>
                <on-error>
                    <base />
                </on-error>
            </policies>
        EOT
    }

  # module.platform_api_gateway_apim_itn.azurerm_api_management_api_operation_policy.platform_legacy_get_server_info will be created
  + resource "azurerm_api_management_api_operation_policy" "platform_legacy_get_server_info" {
      + api_management_name = "io-p-itn-platform-api-gateway-apim-01"
      + api_name            = "io-p-platform-legacy-api"
      + id                  = (known after apply)
      + operation_id        = "getServicesStatus"
      + resource_group_name = "io-p-itn-common-rg-01"
      + xml_content         = <<-EOT
            <policies>
                <inbound>
                    <base />
                    <rewrite-uri template="@(context.Request.OriginalUrl.Path.Replace("/api", ""))" />
                </inbound>
                <backend>
                    <base />
                </backend>
                <outbound>
                    <base />
                </outbound>
                <on-error>
                    <base />
                </on-error>
            </policies>
        EOT
    }

  # module.platform_api_gateway_apim_itn.azurerm_api_management_api_operation_policy.platform_legacy_get_services_status will be created
  + resource "azurerm_api_management_api_operation_policy" "platform_legacy_get_services_status" {
      + api_management_name = "io-p-itn-platform-api-gateway-apim-01"
      + api_name            = "io-p-platform-legacy-api"
      + id                  = (known after apply)
      + operation_id        = "getServicesStatus"
      + resource_group_name = "io-p-itn-common-rg-01"
      + xml_content         = <<-EOT
            <policies>
                <inbound>
                    <base />
                </inbound>
                <backend>
                    <base />
                </backend>
                <outbound>
                    <base />
                </outbound>
                <on-error>
                    <base />
                </on-error>
            </policies>
        EOT
    }

  # module.platform_api_gateway_apim_itn.azurerm_api_management_api_operation_policy.platform_legacy_redirect will be created
  + resource "azurerm_api_management_api_operation_policy" "platform_legacy_redirect" {
      + api_management_name = "io-p-itn-platform-api-gateway-apim-01"
      + api_name            = "io-p-platform-legacy-api"
      + id                  = (known after apply)
      + operation_id        = "Redirect"
      + resource_group_name = "io-p-itn-common-rg-01"
      + xml_content         = <<-EOT
            <policies>
                <inbound>
                    <base />
                    <rewrite-uri template="@(context.Request.OriginalUrl.Path.Replace("/api", ""))" />
                </inbound>
                <backend>
                    <base />
                </backend>
                <outbound>
                    <base />
                </outbound>
                <on-error>
                    <base />
                </on-error>
            </policies>
        EOT
    }

  # module.platform_api_gateway_apim_itn.azurerm_api_management_api_policy.platform_legacy will be created
  + resource "azurerm_api_management_api_policy" "platform_legacy" {
      + api_management_name = "io-p-itn-platform-api-gateway-apim-01"
      + api_name            = "io-p-platform-legacy-api"
      + id                  = (known after apply)
      + resource_group_name = "io-p-itn-common-rg-01"
      + xml_content         = <<-EOT
            <!--
                IMPORTANT:
                - Policy elements can appear only within the <inbound>, <outbound>, <backend> section elements.
                - To apply a policy to the incoming request (before it is forwarded to the backend service), place a corresponding policy element within the <inbound> section element.
                - To apply a policy to the outgoing response (before it is sent back to the caller), place a corresponding policy element within the <outbound> section element.
                - To add a policy, place the cursor at the desired insertion point and select a policy from the sidebar.
                - To remove a policy, delete the corresponding policy statement from the policy document.
                - Position the <base> element within a section element to inherit all policies from the corresponding section element in the enclosing scope.
                - Remove the <base> element to prevent inheriting policies from the corresponding section element in the enclosing scope.
                - Policies are applied in the order of their appearance, from the top down.
                - Comments within policy elements are not supported and may disappear. Place your comments between policy elements or at a higher level scope.
            -->
            <policies>
                <inbound>
                    <base />
                    <!-- This line rewrites the request URI by removing "/platform-legacy" from the original URL path -->
                    <rewrite-uri template="@(context.Request.OriginalUrl.Path.Replace("/platform-legacy", ""))" />
                    <!-- https://docs.microsoft.com/en-us/dotnet/api/system.random.next?view=net-6.0#system-random-next(system-int32-system-int32) -->
                    <set-variable name="urlId" value="@{
                        Random rnd = new Random();
                        int urlId = rnd.Next(1, 3);
                        return urlId.ToString();
                    }" />
                    <choose>
                        <when condition="@(context.Variables.GetValueOrDefault<string>("urlId").Equals("1"))">
                            <set-backend-service base-url="https://io-p-app-appbackendl1.azurewebsites.net" />
                        </when>
                        <when condition="@(context.Variables.GetValueOrDefault<string>("urlId").Equals("2"))">
                            <set-backend-service base-url="https://io-p-app-appbackendl2.azurewebsites.net" />
                        </when>
                        <otherwise>
                            <return-response>
                                <set-status code="500" reason="InternalServerError" />
                                <set-header name="Microsoft-Azure-Api-Management-Correlation-Id" exists-action="override">
                                    <value>@{return Guid.NewGuid().ToString();}</value>
                                </set-header>
                                <set-body>A gateway-related error occurred while processing the request.</set-body>
                            </return-response>
                        </otherwise>
                    </choose>
                </inbound>
                <outbound>
                    <base />
                </outbound>
                <backend>
                    <base />
                </backend>
                <on-error>
                    <base />
                </on-error>
            </policies>
        EOT
    }

  # module.platform_api_gateway_apim_itn.azurerm_api_management_group.platform will be created
  + resource "azurerm_api_management_group" "platform" {
      + api_management_name = "io-p-itn-platform-api-gateway-apim-01"
      + description         = "Owners of io-platform product with management rights"
      + display_name        = "Platform APIM Product Owners"
      + external_id         = "aad://7788edaf-0346-4068-9d79-c868aed15b3d/groups/a0ed72be-f9f9-407e-bf25-91761f8d3de7"
      + id                  = (known after apply)
      + name                = "platform"
      + resource_group_name = "io-p-itn-common-rg-01"
      + type                = "external"
    }

  # module.platform_api_gateway_apim_itn.azurerm_api_management_product.platform will be created
  + resource "azurerm_api_management_product" "platform" {
      + api_management_name   = "io-p-itn-platform-api-gateway-apim-01"
      + approval_required     = false
      + description           = "Product for IO Platform APIs"
      + display_name          = "IO PLATFORM"
      + id                    = (known after apply)
      + product_id            = "io-platform"
      + published             = true
      + resource_group_name   = "io-p-itn-common-rg-01"
      + subscription_required = false
    }

  # module.platform_api_gateway_apim_itn.azurerm_api_management_product_api.platform_platform_legacy will be created
  + resource "azurerm_api_management_product_api" "platform_platform_legacy" {
      + api_management_name = "io-p-itn-platform-api-gateway-apim-01"
      + api_name            = "io-p-platform-legacy-api"
      + id                  = (known after apply)
      + product_id          = "io-platform"
      + resource_group_name = "io-p-itn-common-rg-01"
    }

  # module.platform_api_gateway_apim_itn.azurerm_api_management_product_group.platform will be created
  + resource "azurerm_api_management_product_group" "platform" {
      + api_management_name = "io-p-itn-platform-api-gateway-apim-01"
      + group_name          = "platform"
      + id                  = (known after apply)
      + product_id          = "io-platform"
      + resource_group_name = "io-p-itn-common-rg-01"
    }

  # module.platform_api_gateway_apim_itn.azurerm_api_management_product_policy.platform will be created
  + resource "azurerm_api_management_product_policy" "platform" {
      + api_management_name = "io-p-itn-platform-api-gateway-apim-01"
      + id                  = (known after apply)
      + product_id          = "io-platform"
      + resource_group_name = "io-p-itn-common-rg-01"
      + xml_content         = <<-EOT
            <!--
                IMPORTANT:
                - Policy elements can appear only within the <inbound>, <outbound>, <backend> section elements.
                - To apply a policy to the incoming request (before it is forwarded to the backend service), place a corresponding policy element within the <inbound> section element.
                - To apply a policy to the outgoing response (before it is sent back to the caller), place a corresponding policy element within the <outbound> section element.
                - To add a policy, place the cursor at the desired insertion point and select a policy from the sidebar.
                - To remove a policy, delete the corresponding policy statement from the policy document.
                - Position the <base> element within a section element to inherit all policies from the corresponding section element in the enclosing scope.
                - Remove the <base> element to prevent inheriting policies from the corresponding section element in the enclosing scope.
                - Policies are applied in the order of their appearance, from the top down.
                - Comments within policy elements are not supported and may disappear. Place your comments between policy elements or at a higher level scope.
            -->
            <policies>
                <inbound>
                    <base />
                </inbound>
                <backend>
                    <base />
                </backend>
                <outbound>
                    <base />
                </outbound>
                <on-error>
                    <base />
                </on-error>
            </policies>
        EOT
    }

  # module.platform_api_gateway_apim_itn.module.platform_api_gateway.azurerm_api_management.this will be updated in-place
  ~ resource "azurerm_api_management" "this" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-platform-api-gateway-apim-01"
        name                          = "io-p-itn-platform-api-gateway-apim-01"
        tags                          = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "ModuleName"     = "azure_api_management"
            "ModuleSource"   = "DX"
            "ModuleVersion"  = "1.1.4"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (21 unchanged attributes hidden)

      ~ hostname_configuration {
          ~ proxy {
              ~ default_ssl_binding             = true -> false
                # (11 unchanged attributes hidden)
            }
        }

        # (8 unchanged blocks hidden)
    }

Plan: 11 to add, 2 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.assets_cdn_weu.module.assets_cdn.azurerm_storage_account.this,
  on .terraform/modules/assets_cdn_weu.assets_cdn/storage_account/main.tf line 2, in resource "azurerm_storage_account" "this":
   2: resource "azurerm_storage_account" "this" {

this block has been deprecated and superseded by the
`azurerm_storage_account_static_website` resource and will be removed in v5.0
of the AzureRM provider

(and 18 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
